app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    private function ensureDefaultUsers(): void
    {
        try {
            $model = new UserModel();
            $defaults = [
                [
                    'name' => 'Site Admin',
                    'email' => 'admin@example.com',
                    'password' => password_hash('admin123', PASSWORD_DEFAULT),
                    'role' => 'admin',
                ],
                [
                    'name' => 'Lead Instructor',
                    'email' => 'teacher@example.com',
                    'password' => password_hash('teacher123', PASSWORD_DEFAULT),
                    'role' => 'instructor',
                ],
            ];

            foreach ($defaults as $userData) {
                $exists = $model->where('email', $userData['email'])->first();